In [1]:
import pandas as pd
from sqlalchemy import create_engine
from postgres_pw import postgres_pw

In [2]:
csv_file = "../cleaned_data/cali_ufo.csv"
ufo_data_df = pd.read_csv(csv_file)
ufo_data_df.head()

,datetime,city,state,country,shape,latitude,longitude,date,year
0,2003-10-10 12:00:00,alhambra,ca,us,oval,34.095278,-118.126111,2003-10-10,2003
1,2004-10-10 15:00:00,berkeley,ca,us,unknown,37.871667,-122.271667,2004-10-10,2004
2,2005-10-10 14:45:00,los angeles,ca,us,egg,34.052222,-118.242778,2005-10-10,2005
3,2006-10-10 05:00:00,san francisco,ca,us,triangle,37.775000,-122.418333,2006-10-10,2006
4,2007-10-10 06:00:00,indio,ca,us,oval,33.720556,-116.214722,2007-10-10,2007

In [3]:
import getpass

In [3]:
pw = getpass.getpass()

In [3]:
rds_connection_string = "@localhost:5432/sighting_db"
engine = create_engine(f'postgresql://postgres:{pw}{rds_connection_string}')
engine

In [4]:
ufo_data_df.to_sql(name='ufo_data', con=engine, if_exists='append', index=False)